In [58]:
import pandas as pd

In [59]:
df=pd.read_excel(r"C:\Users\evilk\Downloads\Data Join vs Data Blending.xlsx")
print(df)

    DEPTID  EMPID  BONUS FIRST Name     LAST Name    SALARY
0     10.0    1.0      0      Arnab           Dey   10000.0
1     20.0    2.0    500      Arnab           Dey   20000.0
2     30.0    3.0    500   Pratyush           Das   23000.0
3     40.0    4.0    500      Pinky         gupta   40000.0
4     50.0    NaN      0       Ravi          Kant       NaN
5     60.0    6.0    500      Ravee         Gupta   12673.0
6     70.0    7.0    500    Raveena       Raveena       NaN
7     80.0    NaN    500     Harley        Deavid   10000.0
8      NaN    9.0    500       Moti          Sign       NaN
9    100.0   10.0      0      Sutki         Kumar   20000.0
10   110.0   11.0    500       Lala          Sign   40000.0
11     NaN   12.0    500      Chomu         Gupta   50000.0
12   130.0   13.0    500       Moti           Lal  100000.0
13   140.0   14.0      0     Ankita  Bhattacharya   29999.0
14   150.0   15.0    500     Ankita           Dey   37900.0
15   200.0   16.0    500        NaN           Das   20000.0
16   170.0   17.0      0        NaN         Gupta       NaN
17   180.0   18.0    500    Ankirta        Ghupta   20000.0
18   190.0   19.0      0        NaN        Kumari   10000.0

In [60]:
df=pd.read_excel(r"C:\Users\evilk\Downloads\Data Join vs Data Blending.xlsx")
print(df)

    DEPTID  EMPID  BONUS FIRST Name     LAST Name    SALARY
0     10.0    1.0      0      Arnab           Dey   10000.0
1     20.0    2.0    500      Arnab           Dey   20000.0
2     30.0    3.0    500   Pratyush           Das   23000.0
3     40.0    4.0    500      Pinky         gupta   40000.0
4     50.0    NaN      0       Ravi          Kant       NaN
5     60.0    6.0    500      Ravee         Gupta   12673.0
6     70.0    7.0    500    Raveena       Raveena       NaN
7     80.0    NaN    500     Harley        Deavid   10000.0
8      NaN    9.0    500       Moti          Sign       NaN
9    100.0   10.0      0      Sutki         Kumar   20000.0
10   110.0   11.0    500       Lala          Sign   40000.0
11     NaN   12.0    500      Chomu         Gupta   50000.0
12   130.0   13.0    500       Moti           Lal  100000.0
13   140.0   14.0      0     Ankita  Bhattacharya   29999.0
14   150.0   15.0    500     Ankita           Dey   37900.0
15   200.0   16.0    500        NaN           Das   20000.0
16   170.0   17.0      0        NaN         Gupta       NaN
17   180.0   18.0    500    Ankirta        Ghupta   20000.0
18   190.0   19.0      0        NaN        Kumari   10000.0

### Head and Tail

In [61]:
print(df.head(10))
print("-----------------")

   DEPTID  EMPID  BONUS FIRST Name LAST Name   SALARY
0    10.0    1.0      0      Arnab       Dey  10000.0
1    20.0    2.0    500      Arnab       Dey  20000.0
2    30.0    3.0    500   Pratyush       Das  23000.0
3    40.0    4.0    500      Pinky     gupta  40000.0
4    50.0    NaN      0       Ravi      Kant      NaN
5    60.0    6.0    500      Ravee     Gupta  12673.0
6    70.0    7.0    500    Raveena   Raveena      NaN
7    80.0    NaN    500     Harley    Deavid  10000.0
8     NaN    9.0    500       Moti      Sign      NaN
9   100.0   10.0      0      Sutki     Kumar  20000.0
-----------------

In [62]:
print(df.tail(10))

    DEPTID  EMPID  BONUS FIRST Name     LAST Name    SALARY
9    100.0   10.0      0      Sutki         Kumar   20000.0
10   110.0   11.0    500       Lala          Sign   40000.0
11     NaN   12.0    500      Chomu         Gupta   50000.0
12   130.0   13.0    500       Moti           Lal  100000.0
13   140.0   14.0      0     Ankita  Bhattacharya   29999.0
14   150.0   15.0    500     Ankita           Dey   37900.0
15   200.0   16.0    500        NaN           Das   20000.0
16   170.0   17.0      0        NaN         Gupta       NaN
17   180.0   18.0    500    Ankirta        Ghupta   20000.0
18   190.0   19.0      0        NaN        Kumari   10000.0

### Data Info

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   DEPTID      17 non-null     float64
 1   EMPID       17 non-null     float64
 2   BONUS       19 non-null     int64
 3   FIRST Name  16 non-null     object
 4   LAST Name   19 non-null     object
 5   SALARY      15 non-null     float64
dtypes: float64(3), int64(1), object(2)
memory usage: 1.0+ KB

### Data Describe

In [64]:
df.describe()

           DEPTID      EMPID       BONUS         SALARY
count   17.000000  17.000000   19.000000      15.000000
mean   101.764706  10.411765  342.105263   29571.466667
std     62.673289   5.799341  238.783466   23159.201068
min     10.000000   1.000000    0.000000   10000.000000
25%     50.000000   6.000000    0.000000   16336.500000
50%    100.000000  11.000000  500.000000   20000.000000
75%    150.000000  15.000000  500.000000   38950.000000
max    200.000000  19.000000  500.000000  100000.000000

In [65]:
df.isnull().sum()

DEPTID        2
EMPID         2
BONUS         0
FIRST Name    3
LAST Name     0
SALARY        4
dtype: int64

### Duplicated Values

In [66]:
print(df['FIRST Name'].duplicated())

0     False
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12     True
13    False
14     True
15    False
16     True
17    False
18     True
Name: FIRST Name, dtype: bool

### Removing Duplicated values

In [67]:
df_drop=df.drop_duplicates('FIRST Name')
print(df_drop)

    DEPTID  EMPID  BONUS FIRST Name     LAST Name   SALARY
0     10.0    1.0      0      Arnab           Dey  10000.0
2     30.0    3.0    500   Pratyush           Das  23000.0
3     40.0    4.0    500      Pinky         gupta  40000.0
4     50.0    NaN      0       Ravi          Kant      NaN
5     60.0    6.0    500      Ravee         Gupta  12673.0
6     70.0    7.0    500    Raveena       Raveena      NaN
7     80.0    NaN    500     Harley        Deavid  10000.0
8      NaN    9.0    500       Moti          Sign      NaN
9    100.0   10.0      0      Sutki         Kumar  20000.0
10   110.0   11.0    500       Lala          Sign  40000.0
11     NaN   12.0    500      Chomu         Gupta  50000.0
13   140.0   14.0      0     Ankita  Bhattacharya  29999.0
15   200.0   16.0    500        NaN           Das  20000.0
17   180.0   18.0    500    Ankirta        Ghupta  20000.0

In [68]:
import numpy as np

In [69]:
df_salary=df['SALARY'].replace(np.nan,12000)
print(df_salary)

0      10000.0
1      20000.0
2      23000.0
3      40000.0
4      12000.0
5      12673.0
6      12000.0
7      10000.0
8      12000.0
9      20000.0
10     40000.0
11     50000.0
12    100000.0
13     29999.0
14     37900.0
15     20000.0
16     12000.0
17     20000.0
18     10000.0
Name: SALARY, dtype: float64

In [70]:
df_dups = df.drop_duplicates("LAST Name")
print(df_dups)

    DEPTID  EMPID  BONUS FIRST Name     LAST Name    SALARY
0     10.0    1.0      0      Arnab           Dey   10000.0
2     30.0    3.0    500   Pratyush           Das   23000.0
3     40.0    4.0    500      Pinky         gupta   40000.0
4     50.0    NaN      0       Ravi          Kant       NaN
5     60.0    6.0    500      Ravee         Gupta   12673.0
6     70.0    7.0    500    Raveena       Raveena       NaN
7     80.0    NaN    500     Harley        Deavid   10000.0
8      NaN    9.0    500       Moti          Sign       NaN
9    100.0   10.0      0      Sutki         Kumar   20000.0
12   130.0   13.0    500       Moti           Lal  100000.0
13   140.0   14.0      0     Ankita  Bhattacharya   29999.0
17   180.0   18.0    500    Ankirta        Ghupta   20000.0
18   190.0   19.0      0        NaN        Kumari   10000.0

In [71]:
df_nan = df.dropna()
print(df_nan)

    DEPTID  EMPID  BONUS FIRST Name     LAST Name    SALARY
0     10.0    1.0      0      Arnab           Dey   10000.0
1     20.0    2.0    500      Arnab           Dey   20000.0
2     30.0    3.0    500   Pratyush           Das   23000.0
3     40.0    4.0    500      Pinky         gupta   40000.0
5     60.0    6.0    500      Ravee         Gupta   12673.0
9    100.0   10.0      0      Sutki         Kumar   20000.0
10   110.0   11.0    500       Lala          Sign   40000.0
12   130.0   13.0    500       Moti           Lal  100000.0
13   140.0   14.0      0     Ankita  Bhattacharya   29999.0
14   150.0   15.0    500     Ankita           Dey   37900.0
17   180.0   18.0    500    Ankirta        Ghupta   20000.0

In [72]:
print(df["SALARY"].mean())

29571.466666666667

In [73]:
df['SALARY']=df['SALARY'].replace(np.nan,29571.466666666667)
print(df)

    DEPTID  EMPID  BONUS FIRST Name     LAST Name         SALARY
0     10.0    1.0      0      Arnab           Dey   10000.000000
1     20.0    2.0    500      Arnab           Dey   20000.000000
2     30.0    3.0    500   Pratyush           Das   23000.000000
3     40.0    4.0    500      Pinky         gupta   40000.000000
4     50.0    NaN      0       Ravi          Kant   29571.466667
5     60.0    6.0    500      Ravee         Gupta   12673.000000
6     70.0    7.0    500    Raveena       Raveena   29571.466667
7     80.0    NaN    500     Harley        Deavid   10000.000000
8      NaN    9.0    500       Moti          Sign   29571.466667
9    100.0   10.0      0      Sutki         Kumar   20000.000000
10   110.0   11.0    500       Lala          Sign   40000.000000
11     NaN   12.0    500      Chomu         Gupta   50000.000000
12   130.0   13.0    500       Moti           Lal  100000.000000
13   140.0   14.0      0     Ankita  Bhattacharya   29999.000000
14   150.0   15.0    500     Ankita           Dey   37900.000000
15   200.0   16.0    500        NaN           Das   20000.000000
16   170.0   17.0      0        NaN         Gupta   29571.466667
17   180.0   18.0    500    Ankirta        Ghupta   20000.000000
18   190.0   19.0      0        NaN        Kumari   10000.000000

In [74]:
print(df["SALARY"].mean())

29571.466666666667

In [75]:
print(df)

    DEPTID  EMPID  BONUS FIRST Name     LAST Name         SALARY
0     10.0    1.0      0      Arnab           Dey   10000.000000
1     20.0    2.0    500      Arnab           Dey   20000.000000
2     30.0    3.0    500   Pratyush           Das   23000.000000
3     40.0    4.0    500      Pinky         gupta   40000.000000
4     50.0    NaN      0       Ravi          Kant   29571.466667
5     60.0    6.0    500      Ravee         Gupta   12673.000000
6     70.0    7.0    500    Raveena       Raveena   29571.466667
7     80.0    NaN    500     Harley        Deavid   10000.000000
8      NaN    9.0    500       Moti          Sign   29571.466667
9    100.0   10.0      0      Sutki         Kumar   20000.000000
10   110.0   11.0    500       Lala          Sign   40000.000000
11     NaN   12.0    500      Chomu         Gupta   50000.000000
12   130.0   13.0    500       Moti           Lal  100000.000000
13   140.0   14.0      0     Ankita  Bhattacharya   29999.000000
14   150.0   15.0    500     Ankita           Dey   37900.000000
15   200.0   16.0    500        NaN           Das   20000.000000
16   170.0   17.0      0        NaN         Gupta   29571.466667
17   180.0   18.0    500    Ankirta        Ghupta   20000.000000
18   190.0   19.0      0        NaN        Kumari   10000.000000

In [76]:
df.fillna(method='bfill')

C:\Users\evilk\AppData\Local\Temp\ipykernel_21464\4194935721.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill')

    DEPTID  EMPID  BONUS FIRST Name     LAST Name         SALARY
0     10.0    1.0      0      Arnab           Dey   10000.000000
1     20.0    2.0    500      Arnab           Dey   20000.000000
2     30.0    3.0    500   Pratyush           Das   23000.000000
3     40.0    4.0    500      Pinky         gupta   40000.000000
4     50.0    6.0      0       Ravi          Kant   29571.466667
5     60.0    6.0    500      Ravee         Gupta   12673.000000
6     70.0    7.0    500    Raveena       Raveena   29571.466667
7     80.0    9.0    500     Harley        Deavid   10000.000000
8    100.0    9.0    500       Moti          Sign   29571.466667
9    100.0   10.0      0      Sutki         Kumar   20000.000000
10   110.0   11.0    500       Lala          Sign   40000.000000
11   130.0   12.0    500      Chomu         Gupta   50000.000000
12   130.0   13.0    500       Moti           Lal  100000.000000
13   140.0   14.0      0     Ankita  Bhattacharya   29999.000000
14   150.0   15.0    500     Ankita           Dey   37900.000000
15   200.0   16.0    500    Ankirta           Das   20000.000000
16   170.0   17.0      0    Ankirta         Gupta   29571.466667
17   180.0   18.0    500    Ankirta        Ghupta   20000.000000
18   190.0   19.0      0        NaN        Kumari   10000.000000

In [ ]:
df.loc[df['BONUS']==0,'GETBONUS']='NO BONUS'
df.loc[df['BONUS']>0,'GETBONUS']='GET BONUS'
df

,DEPTID,EMPID,BONUS,FIRST Name,LAST Name,SALARY,GETBONUS,FULL NAME
0,10.0,1.0,0,Arnab,Dey,10000.000000,NO BONUS,Arnab Dey
1,20.0,2.0,500,Arnab,Dey,20000.000000,GET BONUS,Arnab Dey
2,30.0,3.0,500,Pratyush,Das,23000.000000,GET BONUS,Pratyush Das
3,40.0,4.0,500,Pinky,gupta,40000.000000,GET BONUS,Pinky gupta
4,50.0,NaN,0,Ravi,Kant,29571.466667,NO BONUS,Ravi Kant
5,60.0,6.0,500,Ravee,Gupta,12673.000000,GET BONUS,Ravee Gupta
6,70.0,7.0,500,Raveena,Raveena,29571.466667,GET BONUS,Raveena Raveena
7,80.0,NaN,500,Harley,Deavid,10000.000000,GET BONUS,Harley Deavid
8,NaN,9.0,500,Moti,Sign,29571.466667,GET BONUS,Moti Sign
9,100.0,10.0,0,Sutki,Kumar,20000.000000,NO BONUS,Sutki Kumar
10,110.0,11.0,500,Lala,Sign,40000.000000,GET BONUS,Lala Sign
11,NaN,12.0,500,Chomu,Gupta,50000.000000,GET BONUS,Chomu Gupta
12,130.0,13.0,500,Moti,Lal,100000.000000,GET BONUS,Moti Lal
13,140.0,14.0,0,Ankita,Bhattacharya,29999.000000,NO BONUS,Ankita Bhattacharya
14,150.0,15.0,500,Ankita,Dey,37900.000000,GET BONUS,Ankita Dey
15,200.0,16.0,500,NaN,Das,20000.000000,GET BONUS,NaN
16,170.0,17.0,0,NaN,Gupta,29571.466667,NO BONUS,NaN
17,180.0,18.0,500,Ankirta,Ghupta,20000.000000,GET BONUS,Ankirta Ghupta
18,190.0,19.0,0,NaN,Kumari,10000.000000,NO BONUS,NaN

In [94]:
df['FULL NAME']=df["FIRST Name"].str.capitalize() +" "+df['LAST Name'].str.capitalize()
print(df['FULL NAME'])

0               Arnab Dey
1               Arnab Dey
2            Pratyush Das
3             Pinky Gupta
4               Ravi Kant
5             Ravee Gupta
6         Raveena Raveena
7           Harley Deavid
8               Moti Sign
9             Sutki Kumar
10              Lala Sign
11            Chomu Gupta
12               Moti Lal
13    Ankita Bhattacharya
14             Ankita Dey
15                    NaN
16                    NaN
17         Ankirta Ghupta
18                    NaN
Name: FULL NAME, dtype: object

In [95]:
df['BONUS%']=(df['SALARY']/100)*20
print(df)

    DEPTID  EMPID  BONUS FIRST Name     LAST Name         SALARY   GETBONUS  \
0     10.0    1.0      0      Arnab           Dey   10000.000000   NO BONUS
1     20.0    2.0    500      Arnab           Dey   20000.000000  GET BONUS
2     30.0    3.0    500   Pratyush           Das   23000.000000  GET BONUS
3     40.0    4.0    500      Pinky         gupta   40000.000000  GET BONUS
4     50.0    NaN      0       Ravi          Kant   29571.466667   NO BONUS
5     60.0    6.0    500      Ravee         Gupta   12673.000000  GET BONUS
6     70.0    7.0    500    Raveena       Raveena   29571.466667  GET BONUS
7     80.0    NaN    500     Harley        Deavid   10000.000000  GET BONUS
8      NaN    9.0    500       Moti          Sign   29571.466667  GET BONUS
9    100.0   10.0      0      Sutki         Kumar   20000.000000   NO BONUS
10   110.0   11.0    500       Lala          Sign   40000.000000  GET BONUS
11     NaN   12.0    500      Chomu         Gupta   50000.000000  GET BONUS
12   130.0   13.0    500       Moti           Lal  100000.000000  GET BONUS
13   140.0   14.0      0     Ankita  Bhattacharya   29999.000000   NO BONUS
14   150.0   15.0    500     Ankita           Dey   37900.000000  GET BONUS
15   200.0   16.0    500        NaN           Das   20000.000000  GET BONUS
16   170.0   17.0      0        NaN         Gupta   29571.466667   NO BONUS
17   180.0   18.0    500    Ankirta        Ghupta   20000.000000  GET BONUS
18   190.0   19.0      0        NaN        Kumari   10000.000000   NO BONUS

              FULL NAME        BONUS%
0             Arnab Dey   2000.000000
1             Arnab Dey   4000.000000
2          Pratyush Das   4600.000000
3           Pinky Gupta   8000.000000
4             Ravi Kant   5914.293333
5           Ravee Gupta   2534.600000
6       Raveena Raveena   5914.293333
7         Harley Deavid   2000.000000
8             Moti Sign   5914.293333
9           Sutki Kumar   4000.000000
10            Lala Sign   8000.000000
11          Chomu Gupta  10000.000000
12             Moti Lal  20000.000000
13  Ankita Bhattacharya   5999.800000
14           Ankita Dey   7580.000000
15                  NaN   4000.000000
16                  NaN   5914.293333
17       Ankirta Ghupta   4000.000000
18                  NaN   2000.000000

In [97]:
s=pd.Series([1,2,3,4,5,6],index=['a','b','c','d','e','f'])
s

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64